const quotes = [
    'به شخصیت خود….. بیشتر از آبرویتان اهمیت دهید.. زیرا شخصیت شما… جوهر وجود شماست.. و آبرویتان… تصورات دیگران نسبت به شما است',
    'باران که میبارد همه پرندها به دنبال سر پناهند اماعقاب برای اجتناب از خیس شدن بالاتراز ابرهاپرواز میکند این دیدگاه است که تفاوت را خلق میکند…',
    'یک شمع روشن می تواند هزاران شمع خاموش را روشن کند و ذره ای از نورش کاسته نشود …',
    'روزی برای بعضی آدم ها تنها یک خاطره خواهید بود… تلاش کنید که لااقل خاطره ای خوش باشید…',
    'دوست داشتن انسان‌ها به معنای دوست داشتن خود به اندازه ی دیگری است.',
    'من تنها یک چیز می‌دانم و آن اینکه هیچ نمی‌دانم.',
    'تمام محبتت را به پای دوستت بریز نه تمام اعتمادت را.',
    'كسی كه دارای عزمی راسخ است، جهان را مطابق میل خویش عوض می كند.'
]

newQuote();

function newQuote() {
    const randomIndex = Math.floor(Math.random() * quotes.length);
    const quote = quotes[randomIndex];

    document.getElementById('quote').innerHTML = quote;
}

document.getElementById('change-quote').onclick = function() {
    newQuote()
}